#ifndef	____UASmartlink_Ext_H____
	   #define	____UASmartlink_Ext_H____


//--------------------------------------------------------------
////	说明



//--------------------------------------------------------------
////	头文件
////	该头文件会用到的

#include	"uRan_Macro_Contiki.h"
#include	"UA_Func.h"

#include	"sys_status_api.h"


#include	"UASmartlink_Ext_Inc.h"


//--------------------------------------------------------------
////	Option & Version





//--------------------------------------------------------------
////	Define
#define	D_Timer_SmartLink_Monitor_Time	(3 * 60 * CLOCK_SECOND)


//--------------------------------------------------------------
////	结构体...定义



//--------------------------------------------------------------
////	函数声明




//--------------------------------------------------------------
////	变量
process_event_t R_evSmartLink_Monitor;
D_DefineProcess(F_Proc_SmartLink_Monitor);

static struct etimer R_sTimer_SmartLink_Monitor;


//--------------------------------------------------------------
////	Macro


//----------------------------------------







//--------------------------------------------------------------
////	变量




#endif


